In [1]:
# Import the required libraries 
# Import numpy
import numpy as np

# Import pandas
import pandas as pd

In [2]:
# create the dataframe in list formate
# create the list for data.

l1 = ["Virat","Rohit","Shubham","Jayswal","Ishan","Ashwin","Jadeja","Siraj","Jaidev"]
l2 = [11000,15000,5000,170,1000,8000,9500,800,950]
l3 =[121,100,10,150,54,65,51,0,12]

In [3]:
# Convert list into series.
# for l1 
s1 = pd.Series(l1)
# for l2
s2 = pd.Series(l2)
# for l3
s3 = pd.Series(l3)

In [4]:
# convert those series into DataFrame
df = pd.DataFrame([s1,s2,s3],index=["Player","Total","Last Score"])

In [5]:
# Here "T" used with df  is called Transporse.

In [6]:
df = df.T

In [7]:
df

    Player  Total Last Score
0    Virat  11000        121
1    Rohit  15000        100
2  Shubham   5000         10
3  Jayswal    170        150
4    Ishan   1000         54
5   Ashwin   8000         65
6   Jadeja   9500         51
7    Siraj    800          0
8   Jaidev    950         12

In [13]:
## This is also an alternative way to get desired output .

In [10]:
df2 = pd.DataFrame({"Player":s1,"total Runs":s2,"Last Score":s3})

In [12]:
df2

    Player  total Runs  Last Score
0    Virat       11000         121
1    Rohit       15000         100
2  Shubham        5000          10
3  Jayswal         170         150
4    Ishan        1000          54
5   Ashwin        8000          65
6   Jadeja        9500          51
7    Siraj         800           0
8   Jaidev         950          12

In [14]:
## Show the Player name and Total Scores only.

In [ ]:
## This is the method to get specified columns from a dataset

In [17]:
df[["Player","Total"]]

    Player  Total
0    Virat  11000
1    Rohit  15000
2  Shubham   5000
3  Jayswal    170
4    Ishan   1000
5   Ashwin   8000
6   Jadeja   9500
7    Siraj    800
8   Jaidev    950